particle-iot/device-os/hal/src/nRF52840/ble_hal_api.cpp
    // A valid AD structure is composed of Length field, Type field and Data field.
    // Each field should be filled with at least one byte.
    for (uint16_t i = 0; (i + 3) <= len; i = i) {
        *adsLen = data[i];

        uint8_t adsType = data[i + 1];
        if (adsType == flag) {
            // The value of adsLen doesn't include the length field of an AD structure.
            if ((i + *adsLen + 1) <= len) {
                *offset = i;
                *adsLen += 1;
                return SYSTEM_ERROR_NONE;
            }
            else {
                return SYSTEM_ERROR_INTERNAL;
            }
        }
        else {
            // Navigate to the next AD structure.
            i += (*adsLen + 1);
        }
    }

    return SYSTEM_ERROR_NOT_FOUND;
}

static int adStructEncode(uint8_t adType, uint8_t* data, uint16_t len, uint8_t flag) {
    uint8_t*  pAdvData = NULL;
    uint16_t* pAdvDataLen = NULL;
    uint16_t  offset;
    uint16_t  adsLen;
    bool      adsExist = false;

    if (flag == BLE_ADV_DATA_ADVERTISING) {
        pAdvData    = s_bleInstance.advData;
        pAdvDataLen = &s_bleInstance.advDataLen;
    }
    else if (flag == BLE_ADV_DATA_SCAN_RESPONSE && adType != BLE_SIG_AD_TYPE_FLAGS) {
        // The scan response data should not contain the AD Flags AD structure.
        pAdvData    = s_bleInstance.scanRespData;
        pAdvDataLen = &s_bleInstance.scanRespDataLen;
    }
    else {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    if (locateAdStructure(adType, pAdvData, *pAdvDataLen, &offset, &adsLen) == SYSTEM_ERROR_NONE) {
        adsExist = true;
    }

    if (data == NULL) {
        // The advertising data must contain the AD Flags AD structure.
        if (adType == BLE_SIG_AD_TYPE_FLAGS) {
            return SYSTEM_ERROR_NOT_SUPPORTED;
        }

        // Remove the AD structure from advertising data.
        if (adsExist == true) {
            uint16_t moveLen = *pAdvDataLen - offset - adsLen;
            memcpy(&pAdvData[offset], &pAdvData[offset + adsLen], moveLen);
            *pAdvDataLen = *pAdvDataLen - adsLen;
        }

        return SYSTEM_ERROR_NONE;
    }
    else if (adsExist) {
        // Update the existing AD structure.
        uint16_t staLen = *pAdvDataLen - adsLen;
        if ((staLen + len + 2) <= BLE_MAX_ADV_DATA_LEN) {
            // Firstly, move the last consistent block.
            uint16_t moveLen = *pAdvDataLen - offset - adsLen;
            memmove(&pAdvData[offset + len], &pAdvData[offset + adsLen], moveLen);

            // Secondly, Update the AD structure.
            // The Length field is the total length of Type field and Data field.
            pAdvData[offset + 1] = len + 1;
            memcpy(&pAdvData[offset + 2], data, len);

            // An AD structure is composed of one byte length field, one byte Type field and Data field.
            *pAdvDataLen = staLen + len + 2;
            return SYSTEM_ERROR_NONE;
        }
        else {
            return SYSTEM_ERROR_LIMIT_EXCEEDED;
        }
    }
    else {
        // Append the AD structure at the and of advertising data.
        if ((*pAdvDataLen + len + 2) <= BLE_MAX_ADV_DATA_LEN) {
            pAdvData[(*pAdvDataLen)++] = len + 1;
            pAdvData[(*pAdvDataLen)++] = adType;
            memcpy(&pAdvData[*pAdvDataLen], data, len);
            *pAdvDataLen += len;
            return SYSTEM_ERROR_NONE;
        }
        else {
            return SYSTEM_ERROR_LIMIT_EXCEEDED;
        }
    }
}

int setAdvData(uint8_t* data, uint16_t len, uint8_t flag) {
    if ((data == NULL) || (len < 3 && flag == BLE_ADV_DATA_ADVERTISING)) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    bool advPending = false;

    // It is invalid to provide the same data buffers while advertising.
    if (s_bleInstance.advertising) {
        int err = ble_stop_advertising();
        if (err != SYSTEM_ERROR_NONE) {
            return err;
        }
        advPending = true;
    }

    // Make sure the scan response data is consistent.
    ble_gap_adv_data_t bleGapAdvData;
    if (flag == BLE_ADV_DATA_ADVERTISING) {
        bleGapAdvData.adv_data.p_data      = data;
        bleGapAdvData.adv_data.len         = len;
        bleGapAdvData.scan_rsp_data.p_data = s_bleInstance.scanRespData;
        bleGapAdvData.scan_rsp_data.len    = s_bleInstance.scanRespDataLen;
    }
    else {
        bleGapAdvData.adv_data.p_data      = s_bleInstance.advData;
        bleGapAdvData.adv_data.len         = s_bleInstance.advDataLen;
        bleGapAdvData.scan_rsp_data.p_data = data;
        bleGapAdvData.scan_rsp_data.len    = len;
    }

    ret_code_t ret = sd_ble_gap_adv_set_configure(&s_bleInstance.advHandle, &bleGapAdvData, NULL);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_adv_set_configure() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    if (flag == BLE_ADV_DATA_ADVERTISING) {
        memcpy(s_bleInstance.advData, data, len);
        s_bleInstance.advDataLen = len;
    }
    else {
        memcpy(s_bleInstance.scanRespData, data, len);
        s_bleInstance.scanRespDataLen = len;
    }

    if (advPending) {
        advPending = false;
        return ble_start_advertising();
    }

    return SYSTEM_ERROR_NONE;
}

static bool isConnParamsFeeded(hal_ble_conn_params_t* conn_params) {
    hal_ble_conn_params_t ppcp;

    if (ble_get_ppcp(&ppcp) == SYSTEM_ERROR_NONE) {
        uint16_t minAcceptedSl = ppcp.slave_latency - MIN(BLE_CONN_PARAMS_SLAVE_LATENCY_ERR, ppcp.slave_latency);
        uint16_t maxAcceptedSl = ppcp.slave_latency + BLE_CONN_PARAMS_SLAVE_LATENCY_ERR;
        uint16_t minAcceptedTo = ppcp.conn_sup_timeout - MIN(BLE_CONN_PARAMS_TIMEOUT_ERR, ppcp.conn_sup_timeout);
        uint16_t maxAcceptedTo = ppcp.conn_sup_timeout + BLE_CONN_PARAMS_TIMEOUT_ERR;

        if (conn_params->max_conn_interval < ppcp.min_conn_interval ||
                conn_params->max_conn_interval > ppcp.max_conn_interval) {
            return false;
        }
        if (conn_params->slave_latency < minAcceptedSl ||
                conn_params->slave_latency > maxAcceptedSl) {
            return false;
        }
        if (conn_params->conn_sup_timeout < minAcceptedTo ||
                conn_params->conn_sup_timeout > maxAcceptedTo) {
            return false;
        }
    }

