particle-iot/device-os/hal/src/nRF52840/ble_hal_api.cpp
    return true;
}

static void connParamsUpdateTimerCb(os_timer_t timer) {
    if (s_bleInstance.connHandle == BLE_INVALID_CONN_HANDLE) {
        return;
    }

    hal_ble_conn_params_t ppcp;
    if (ble_get_ppcp(&ppcp) == SYSTEM_ERROR_NONE) {
        ble_gap_conn_params_t connParams;
        connParams.min_conn_interval = ppcp.min_conn_interval;
        connParams.max_conn_interval = ppcp.max_conn_interval;
        connParams.slave_latency     = ppcp.slave_latency;
        connParams.conn_sup_timeout  = ppcp.conn_sup_timeout;

        ret_code_t ret = sd_ble_gap_conn_param_update(s_bleInstance.connHandle, &connParams);
        if (ret != NRF_SUCCESS) {
            LOG(WARN, "sd_ble_gap_conn_param_update() failed: %u", (unsigned)ret);
            return;
        }

        s_bleInstance.connParamsUpdateAttempts++;
    }
}

static void updateConnParamsIfNeeded(void) {
    if (s_bleInstance.role == BLE_ROLE_PERIPHERAL && !isConnParamsFeeded(&s_bleInstance.effectiveConnParams)) {
        if (s_bleInstance.connParamsUpdateAttempts < BLE_CONN_PARAMS_UPDATE_ATTEMPS) {
            if (s_bleInstance.connParamsUpdateTimer != NULL) {
                if (os_timer_change(s_bleInstance.connParamsUpdateTimer, OS_TIMER_CHANGE_START, true, 0, 0, NULL)) {
                    LOG(ERROR, "os_timer_change() failed.");
                    return;
                }
            }
            LOG_DEBUG(TRACE, "Attempts to update BLE connection parameters, try: %d after %d ms",
                    s_bleInstance.connParamsUpdateAttempts, BLE_CONN_PARAMS_UPDATE_DELAY_MS);
        }
        else {
            ret_code_t ret = sd_ble_gap_disconnect(s_bleInstance.connHandle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_disconnect() failed: %u", (unsigned)ret);
                return;
            }
            LOG_DEBUG(TRACE, "Disconnecting. Update BLE connection parameters failed.");
        }
    }
}

static int addService(uint8_t type, const ble_uuid_t* uuid, uint16_t* handle) {
    ret_code_t ret;
    ret = sd_ble_gatts_service_add(type, uuid, handle);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gatts_service_add() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    LOG_DEBUG(TRACE, "Service handle: %d.", *handle);

    return SYSTEM_ERROR_NONE;
}

static int addCharacteristic(uint16_t service_handle, const ble_uuid_t* uuid, uint8_t properties, const char* desc, hal_ble_char_t* ble_char) {
    ret_code_t               ret;
    ble_gatts_char_md_t      char_md;
    ble_gatts_attr_md_t      value_attr_md;
    ble_gatts_attr_md_t      user_desc_attr_md;
    ble_gatts_attr_md_t      cccd_attr_md;
    ble_gatts_attr_t         char_value_attr;
    ble_gatts_char_handles_t char_handles;

    /* Characteristic metadata */
    memset(&char_md, 0, sizeof(char_md));
    char_md.char_props.broadcast      = (properties & BLE_SIG_CHAR_PROP_BROADCAST) ? 1 : 0;
    char_md.char_props.read           = (properties & BLE_SIG_CHAR_PROP_READ) ? 1 : 0;
    char_md.char_props.write_wo_resp  = (properties & BLE_SIG_CHAR_PROP_WRITE_WO_RESP) ? 1 : 0;
    char_md.char_props.write          = (properties & BLE_SIG_CHAR_PROP_WRITE) ? 1 : 0;
    char_md.char_props.notify         = (properties & BLE_SIG_CHAR_PROP_NOTIFY) ? 1 : 0;
    char_md.char_props.indicate       = (properties & BLE_SIG_CHAR_PROP_INDICATE) ? 1 : 0;
    char_md.char_props.auth_signed_wr = (properties & BLE_SIG_CHAR_PROP_AUTH_SIGN_WRITES) ? 1 : 0;
    // User Description Descriptor
    if (desc != NULL) {
        memset(&user_desc_attr_md, 0, sizeof(user_desc_attr_md));
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&user_desc_attr_md.read_perm);
        BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&user_desc_attr_md.write_perm);
        user_desc_attr_md.vloc    = BLE_GATTS_VLOC_STACK;
        user_desc_attr_md.rd_auth = 0;
        user_desc_attr_md.wr_auth = 0;
        user_desc_attr_md.vlen    = 0;

        char_md.p_char_user_desc        = (const uint8_t *)desc;
        char_md.char_user_desc_max_size = strlen(desc);
        char_md.char_user_desc_size     = strlen(desc);
        char_md.p_user_desc_md          = &user_desc_attr_md;
    }
    else {
        char_md.p_char_user_desc = NULL;
        char_md.p_user_desc_md   = NULL;
    }
    // Client Characteristic Configuration Descriptor
    if (char_md.char_props.notify || char_md.char_props.indicate) {
        memset(&cccd_attr_md, 0, sizeof(cccd_attr_md));
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_attr_md.read_perm);
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_attr_md.write_perm);
        cccd_attr_md.vloc = BLE_GATTS_VLOC_STACK;

        char_md.p_cccd_md = &cccd_attr_md;
    }
    // TODO:
    char_md.p_char_pf = NULL;
    char_md.p_sccd_md = NULL;

    /* Characteristic value attribute metadata */
    memset(&value_attr_md, 0, sizeof(value_attr_md));
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&value_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&value_attr_md.write_perm);
    value_attr_md.vloc    = BLE_GATTS_VLOC_STACK;
    value_attr_md.rd_auth = 0;
    value_attr_md.wr_auth = 0;
    value_attr_md.vlen    = 1;

    /* Characteristic value attribute */
    memset(&char_value_attr, 0, sizeof(char_value_attr));
    char_value_attr.p_uuid    = uuid;
    char_value_attr.p_attr_md = &value_attr_md;
    char_value_attr.init_len  = 0;
    char_value_attr.init_offs = 0;
    char_value_attr.max_len   = BLE_MAX_CHAR_VALUE_LEN;
    char_value_attr.p_value   = NULL;

    ret = sd_ble_gatts_characteristic_add(service_handle, &char_md, &char_value_attr, &char_handles);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gatts_characteristic_add() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    ble_char->properties       = properties;
    ble_char->value_handle     = char_handles.value_handle;
    ble_char->user_desc_handle = char_handles.user_desc_handle;
    ble_char->cccd_handle      = char_handles.cccd_handle;
    ble_char->sccd_handle      = char_handles.sccd_handle;

    LOG_DEBUG(TRACE, "Characteristic value handle: %d.", char_handles.value_handle);
    LOG_DEBUG(TRACE, "Characteristic cccd handle: %d.", char_handles.cccd_handle);

    return SYSTEM_ERROR_NONE;
}

static void dispatchBleEvent(hal_ble_event_t* evt) {
    for (uint8_t i = 0; i < BLE_MAX_EVENT_CALLBACK_COUNT; i++) {
        if (s_bleInstance.evtCallbacks[i] != NULL) {
            s_bleInstance.evtCallbacks[i](evt);
        }
    }
}

static void isrProcessBleEvent(const ble_evt_t* event, void* context) {
    ret_code_t      ret;
    hal_ble_event_t bleEvt;

